# 제곱 함수와 n 제곱 함수 만들기

In [1]:
def my_sq(x):
    return x**2
def my_exp(x,n):
    return x**n
print(my_sq(2))
print(my_exp(2,3))

4
8

# 시리즈와 apply 메서드

In [2]:
import pandas as pd
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [5]:
print(df['a']**2)

0    100
1    400
2    900
Name: a, dtype: int64

In [6]:
sq = df['a'].apply(my_sq)
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [8]:
# df['a']의 값이 my_exp함수의 첫 번째 인자로 넘어간다.
sq=df['a'].apply(my_exp, n=3)
print(sq)

0     1000
1     8000
2    27000
Name: a, dtype: int64

# 데이터 프레임과 apply 메서드

In [9]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})

In [10]:
def print_me(x):
    print(x)

In [11]:
# axis = 0 : 열방향
print(df.apply(print_me, axis=0))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [14]:
print(df.apply(print_me))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [15]:
print(df['a'])

0    10
1    20
2    30
Name: a, dtype: int64

In [16]:
print(df['b'])

0    20
1    30
2    40
Name: b, dtype: int64

In [13]:
# axis = 1 : 행방향
print(df.apply(print_me, axis=1))

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64
0    None
1    None
2    None
dtype: object

avg_3 함수에 열 단위 데이터(df['a'], df['b']) 값이 전달되어 avg_3함수에서는 1개의 인자로 인식하여 오류가 발생하였다.

In [20]:
def avg_3(x,y,z):
    return (x+y+z)/3

print(df.apply(avg_3))

TypeError: avg_3() missing 2 required positional arguments: 'y' and 'z'

In [22]:
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    print(x,y,z)
    return (x+y+z)/3

print(df.apply(avg_3_apply))

10 20 30
20 30 40
a    20.0
b    30.0
dtype: float64

In [24]:
def avg_3_apply_general(col):
    sum = 0
    print(col)
    for i in col:
        sum += i
    return sum/df.shape[0]

print(df.apply(avg_3_apply_general))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    20.0
b    30.0
dtype: float64

In [25]:
def avg_2_apply(row):
    sum = 0
    for i in row:
        sum += i
    return sum/df.shape[1]

print(df.apply(avg_2_apply, axis=1))

0    15.0
1    25.0
2    35.0
dtype: float64

# 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기 - 열 방향

In [26]:
import seaborn as sns
titanic  = sns.load_dataset('titanic')

In [27]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

count_missing 함수

In [43]:
import numpy as np

def count_missing(vec):
#     print(vec)
    null_vec = pd.isnull(vec)
#     print(null_vec)
    null_count = np.sum(null_vec)
    return null_count

In [44]:
cmis_col = titanic.apply(count_missing)
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [39]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

prop_missing : 누락값의 비율 계산

In [47]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num/dem

pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [50]:
missing_value=titanic.isnull().sum()
print(missing_value/len(titanic))

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [55]:
1- titanic.count() / len(titanic)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [59]:
print(missing_value.mean())

57.93333333333333

In [62]:
print(titanic.isna().mean())

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [63]:
print(titanic.isna().mean().round(4))

survived       0.0000
pclass         0.0000
sex            0.0000
age            0.1987
sibsp          0.0000
parch          0.0000
fare           0.0000
embarked       0.0022
class          0.0000
who            0.0000
adult_male     0.0000
deck           0.7722
embark_town    0.0022
alive          0.0000
alone          0.0000
dtype: float64

In [64]:
print(titanic.isna().mean().round(4) * 100)

survived        0.00
pclass          0.00
sex             0.00
age            19.87
sibsp           0.00
parch           0.00
fare            0.00
embarked        0.22
class           0.00
who             0.00
adult_male      0.00
deck           77.22
embark_town     0.22
alive           0.00
alone           0.00
dtype: float64

누락값이 아닌 데이터 비율

In [67]:
titanic.count() / len(titanic)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [69]:
def prop_complete(vec):
    return 1- prop_missing(vec)

pcom_row = titanic.apply(prop_complete)
print(pcom_row)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

# 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기 - 행 방뱡

In [71]:
cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

# 각 행의 누락값
print(cmis_row.head())

# 각 행의 누락값의 비율
print(pmis_row.head())

# 각 행의 누락값이 아닌 비율
print(pcom_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64
0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64
0    0.933333
1    1.000000
2    0.933333
3    1.000000
4    0.933333
dtype: float64

In [72]:
titanic['num_missing']=titanic.apply(count_missing, axis=1)
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  num_missing
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            1
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1

In [73]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [77]:
titanic.isnull().sum(axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [78]:
titanic['num_missing_prac']=titanic.isnull().sum(axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing,num_missing_prac
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1,1

In [84]:
titanic['num_missing']

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Name: num_missing, Length: 891, dtype: int64

In [83]:
titanic['num_missing_prac']

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Name: num_missing_prac, Length: 891, dtype: int64

In [86]:
titanic['num_missing']==titanic['num_missing_prac']

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Length: 891, dtype: bool

In [85]:
titanic['num_missing'].equals(titanic['num_missing_prac'])

True

누락값이 2게 이사인 데이터만 추출

In [87]:
print(titanic.loc[titanic.num_missing>1, :].sample(10))

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
468         0       3    male  NaN      0      0   7.7250        Q   Third
868         0       3    male  NaN      0      0   9.5000        S   Third
568         0       3    male  NaN      0      0   7.2292        C   Third
158         0       3    male  NaN      0      0   8.6625        S   Third
727         1       3  female  NaN      0      0   7.7375        Q   Third
531         0       3    male  NaN      0      0   7.2292        C   Third
481         0       2    male  NaN      0      0   0.0000        S  Second
375         1       1  female  NaN      1      0  82.1708        C   First
28          1       3  female  NaN      0      0   7.8792        Q   Third
26          0       3    male  NaN      0      0   7.2250        C   Third

       who  adult_male deck  embark_town alive  alone  num_missing  \
468    man        True  NaN   Queenstown    no   True            2
868    man        True  NaN  Southampton    no   True            2
568    man        True  NaN    Cherbourg    no   True            2
158    man        True  NaN  Southampton    no   True            2
727  woman       False  NaN   Queenstown   yes   True            2
531    man        True  NaN    Cherbourg    no   True            2
481    man        True  NaN  Southampton    no   True            2
375  woman       False  NaN    Cherbourg   yes  False            2
28   woman       False  NaN   Queenstown   yes   True            2
26     man        True  NaN    Cherbourg    no   True            2

     num_missing_prac
468                 2
868                 2
568                 2
158                 2
727                 2
531                 2
481                 2
375                 2
28                  2
26                  2

In [89]:
print(titanic.loc[titanic.num_missing>1, :].head(10))

    survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
5          0       3    male  NaN      0      0   8.4583        Q   Third
17         1       2    male  NaN      0      0  13.0000        S  Second
19         1       3  female  NaN      0      0   7.2250        C   Third
26         0       3    male  NaN      0      0   7.2250        C   Third
28         1       3  female  NaN      0      0   7.8792        Q   Third
29         0       3    male  NaN      0      0   7.8958        S   Third
32         1       3  female  NaN      0      0   7.7500        Q   Third
36         1       3    male  NaN      0      0   7.2292        C   Third
42         0       3    male  NaN      0      0   7.8958        C   Third
45         0       3    male  NaN      0      0   8.0500        S   Third

      who  adult_male deck  embark_town alive  alone  num_missing  \
5     man        True  NaN   Queenstown    no   True            2
17    man        True  NaN  Southampton   yes   True            2
19  woman       False  NaN    Cherbourg   yes   True            2
26    man        True  NaN    Cherbourg    no   True            2
28  woman       False  NaN   Queenstown   yes   True            2
29    man        True  NaN  Southampton    no   True            2
32  woman       False  NaN   Queenstown   yes   True            2
36    man        True  NaN    Cherbourg   yes   True            2
42    man        True  NaN    Cherbourg    no   True            2
45    man        True  NaN  Southampton    no   True            2

    num_missing_prac
5                  2
17                 2
19                 2
26                 2
28                 2
29                 2
32                 2
36                 2
42                 2
45                 2

In [88]:
titanic.loc[titanic.num_missing>1, :]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing,num_missing_prac
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2,2
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,2,2
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,2,2
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2,2
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,2